ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/flightrec.c
void flightrec_init(void)
{
    s_ready = 0; s_have_dump = 0; s_head = 0; s_count = 0; s_dumped = 0;
    s_have_read = 0; s_seq_next = 1u;
    if (osMutexAcquire(qspiMutexHandle, 500u) != osOK) return;

    /* Najdi sektor s nejvyssim seq (= posledni dump) a prvni VOLNY (smazany). */
    uint32_t best_seq = 0; int have_best = 0; int free_idx = -1;
    for (uint32_t i = 0; i < W25Q_FLIGHTREC_SECTORS; i++) {
        uint8_t h[FR_REC_SIZE];
        uint32_t off = W25Q_FLIGHTREC_BASE + i * W25Q_SECTOR_SIZE;
        if (!w25q_read(off, h, sizeof h)) continue;
        uint32_t seq;
        if (hdr_unpack(h, &seq, NULL, NULL, NULL)) {
            if (!have_best || seq > best_seq) { have_best = 1; best_seq = seq; s_read_off = off; }
        } else if (free_idx < 0 && get32(h) == 0xFFFFFFFFu) {
            free_idx = (int)i;                      /* smazany -> pouzitelny hned */
        }
    }
    /* ⚠️ seq NESMI byt odvozena od uptime — to se po resetu vraci k nule, takze by
     * novejsi dump mohl mit nizsi seq nez starsi a `init` by pak vyhrabal ten stary.
     * Proto navazujeme na nejvyssi nalezenou hodnotu. */
    s_have_dump = have_best ? 1u : 0u;
    s_have_read = s_have_dump;
    if (have_best) s_seq_next = best_seq + 1u;

    /* Cilovy sektor pro PRISTI dump. Kdyz zadny smazany neni, smaz nejstarsi
     * (nejnizsi index za poslednim) — deje se to jen jednou za 64 dumpu. */
    if (free_idx >= 0) {
        s_write_off = W25Q_FLIGHTREC_BASE + (uint32_t)free_idx * W25Q_SECTOR_SIZE;
        s_ready = 1;
    } else {
        s_write_off = W25Q_FLIGHTREC_BASE;
        if (w25q_erase_sector(s_write_off)) s_ready = 1;
    }
    osMutexRelease(qspiMutexHandle);
}

void flightrec_tick(void)
{
    uint32_t now = HAL_GetTick();
    if ((int32_t)(now - s_next_ms) < 0) return;
    s_next_ms = now + 1000u;

    fr_rec_t r;
    memset(&r, 0, sizeof r);
    r.uptime_s      = (uint16_t)g_uptime_s;
    r.cpu_pct       = (uint8_t)(g_rtos_cpu_pct > 255u ? 255u : g_rtos_cpu_pct);
    r.heap_free_256 = (uint16_t)(g_rtos_heap_free / 256u);

    /* Nejmensi volny stack — presne to, co u #18 zajima.
     * ⚠️ VYSLOVNE JEN NASICH 5 TASKU, ne `osThreadEnumerate`. Ten vraci i vnitrni
     * vlakna FreeRTOS (IDLE, Tmr Svc), jejichz rezerva je mala a NEMENNA — minimum
     * pak vzdy hlasilo jejich konstantu (na HW 416 B pres boot i 200 s behu),
     * zatimco UART `status` nad nasimi tasky hlasil 736 B. Metrika tim byla
     * MASKOVANA: kdyby defaultTask klesl ze 736 B na 100 B (presne scenar #18),
     * recorder by dal ukazoval 416 a nikdo by si niceho nevsiml.
     * Seznam je zamerne tentyz jako v `status`, aby se ty dva udaje uz nerozesly.
     * `osThreadGetStackSpace` je drahe (scan zasobniku), ale 1x/s pres 5 tasku
     * je zanedbatelne a bezi to v defaultTask. */
    static const struct { const char *n; osThreadId_t *h; } TL[] = {
        {"default", &defaultTaskHandle}, {"Uart", &UartTaskHandle},
        {"I2C4",    &I2C4TaskHandle},    {"Ui",   &UiTaskHandle},
        {"Fpga",    &FpgaTaskHandle},
    };
    uint32_t smin = 0xFFFFFFFFu;
    uint16_t swho = 0xFFFFu;                      /* index nejtesnejsiho tasku */
    for (unsigned i = 0; i < sizeof(TL) / sizeof(TL[0]); i++) {
        if (*TL[i].h == NULL) continue;
        uint32_t sp = osThreadGetStackSpace(*TL[i].h);
        if (sp && sp < smin) { smin = sp; swho = (uint16_t)i; }
    }
    r.stack_min_8 = (uint16_t)((smin == 0xFFFFFFFFu) ? 0u : (smin / 8u));
    /* Do ted nevyuzity `spare`: KTERY task byl nejtesnejsi. Bez toho rekne dump
     * jen "nekomu doslo misto", ale ne komu — a to je u #18 ta podstatna cast. */
    r.spare = swho;

    r.t_ocxo_c10  = (int16_t)(g_sensors[SENS_T49].last * 10.0f);
    r.t_board_c10 = (int16_t)(g_sensors[SENS_T48].last * 10.0f);
    uint32_t ierr = 0;
    for (int i = 0; i < SENS_COUNT; i++)
        if (i != (int)SENS_T4A) ierr += g_sensors[i].err_streak;   /* 0x4A neosazen */
    r.i2c_err = (uint16_t)(ierr > 0xFFFFu ? 0xFFFFu : ierr);

    if (g_spi_ok)      r.flags |= FR_F_FPGA_LINK;
    if (g_freq_stale)  r.flags |= FR_F_FREQ_STALE;
    if (g_cm4_alive)   r.flags |= FR_F_CM4_ALIVE;

    s_ring[s_head] = r;
    s_head = (uint16_t)((s_head + 1u) % FR_DEPTH);
    if (s_count < FR_DEPTH) s_count++;
}

void flightrec_dump(const char *reason)
{
    if (!s_ready || s_dumped) return;   /* jen jednou za beh — sektor je jeden */
    s_dumped = 1;

    /* ⚠️ Kratky timeout: dumpuje se pri poruse a do IWDG resetu zbyva ~1,5 s.
     * Kdyz je QSPI zrovna obsazena, radeji nic nez zaseknout se tesne pred resetem. */
    if (osMutexAcquire(qspiMutexHandle, FR_LOCK_MS) != osOK) return;

    uint8_t buf[FR_REC_SIZE];
    hdr_pack(buf, s_seq_next, s_count, g_uptime_s, reason);
    if (w25q_write(s_write_off, buf, FR_REC_SIZE)) {
        /* Vzorky od NEJSTARSIHO po nejnovejsi. */
        uint16_t start = (uint16_t)((s_head + FR_DEPTH - s_count) % FR_DEPTH);
        for (uint16_t i = 0; i < s_count; i++) {
            rec_pack(buf, &s_ring[(start + i) % FR_DEPTH]);
            if (!w25q_write(s_write_off + FR_REC_SIZE + (uint32_t)i * FR_REC_SIZE,
                            buf, FR_REC_SIZE)) break;
        }
        /* ⚠️ Bez tehle dvojice cetl `flightrec_report` porad z `s_read_off`, ktery
         * plni jen `init` z JIZ existujiciho dumpu — cerstve zapsany dump se tedy
         * neprecetl (pri prvnim behu dokonce z offsetu 0). */
        s_read_off  = s_write_off;
        s_have_read = 1;
        s_have_dump = 1;
        s_seq_next++;
    }
    osMutexRelease(qspiMutexHandle);
}

bool flightrec_have(void) { return s_have_dump ? true : false; }

bool flightrec_report(void)
{
    if (!s_have_dump || !s_have_read) return false;
    uint8_t b[FR_REC_SIZE];
    uint32_t seq, up; uint16_t n; char r2[FR_REASON_MAX];

    if (osMutexAcquire(qspiMutexHandle, 500u) != osOK) return false;
    bool ok = w25q_read(s_read_off, b, sizeof b) && hdr_unpack(b, &seq, &n, &up, r2);
    osMutexRelease(qspiMutexHandle);
    if (!ok) return false;

    if (n > FR_DEPTH) n = FR_DEPTH;
    printf("FLIGHT RECORDER: %u vzorku, dump v uptime %lus, duvod '%s'\n",
           (unsigned)n, (unsigned long)up, r2);
    printf("  t[s]  CPU%%  heap    stack_min kdo      OCXO  deska  I2Cerr  flags\n");
    for (uint16_t i = 0; i < n; i++) {
        if (osMutexAcquire(qspiMutexHandle, 500u) != osOK) break;
        ok = w25q_read(s_read_off + FR_REC_SIZE + (uint32_t)i * FR_REC_SIZE, b, sizeof b);
        osMutexRelease(qspiMutexHandle);
        if (!ok) break;
        /* Hlavicka se zapisuje PRVNI (at pri poruse prezije aspon duvod), takze
         * pri prerusenem dumpu muze byt zbytek jeste smazany — takove vzorky
         * neni co tisknout. */
        if (get32(b) == 0xFFFFFFFFu && get32(b + 4) == 0xFFFFFFFFu) break;
        fr_rec_t r; rec_unpack(b, &r);
        /* `spare` = index nejtesnejsiho tasku (0xFFFF u starsich dumpu, kde se
         * jeste neukladal — tam se vypise "?"). */
        static const char *TN[] = { "default", "Uart", "I2C4", "Ui", "Fpga" };
        const char *who = (r.spare < (sizeof TN / sizeof TN[0])) ? TN[r.spare] : "?";
        printf("  %5u %4u  %6lu  %7lu %-7s  %3d.%u %3d.%u  %5u   %c%c%c\n",
               (unsigned)r.uptime_s, (unsigned)r.cpu_pct,
               (unsigned long)r.heap_free_256 * 256u,
               (unsigned long)r.stack_min_8 * 8u, who,
               r.t_ocxo_c10 / 10, (unsigned)(abs(r.t_ocxo_c10) % 10),
               r.t_board_c10 / 10, (unsigned)(abs(r.t_board_c10) % 10),
               (unsigned)r.i2c_err,
               (r.flags & FR_F_FPGA_LINK)  ? 'F' : '-',
               (r.flags & FR_F_FREQ_STALE) ? 'S' : '-',
               (r.flags & FR_F_CM4_ALIVE)  ? '4' : '-');
        osDelay(2);   /* nezahlt konzoli (stejny vzor jako `sensors`) */
    }
    return true;
}

/* ══════════════════════════════════════════════════════════════════════════
 * ERRLOG — trvaly zaznamnik chyb (rozhrani v `errlog.h`)
 *
 * ⚠️ PROC ZROVNA TADY a ne ve vlastnim `errlog.c`: novy `.c` se do buildu
 * NEDOSTANE bez `Close Project -> Open Project` v IDE (prelozi se, ale linker
 * hlasi `undefined reference`, protoze chybi v `Release` -> `subdir.mk`).
 * Hlavicky tenhle problem nemaji, takze API zustava v `errlog.h`.
 * Domenove to sem patri — `flightrec` uz resi tytez veci: zapis do W25Q pri
 * porse, predem smazany sektor a zakaz zapisu z exception kontextu.
 * ══════════════════════════════════════════════════════════════════════════ */

#include "errlog.h"
#include "datalog.h"      /* datalog_crc16, datalog_now_unix */

