ok2haz/Frequency_Counter_FPGA/Frequency_Counter_STM32H757/CM7/Core/Src/flightrec.c
    __set_PRIMASK(pm);
    return emit;
}

void errlog_tick(void)
{
    if (!s_el_ready || s_el_tail_i == s_el_head_i) return;

    /* ⚠️ Kratky timeout: defaultTask krmi watchdog a NESMI cekat na obsazenou
     * flash. Kdyz to nevyjde, zaznamy zustanou v ringu do dalsiho tiku. */
    if (osMutexAcquire(qspiMutexHandle, 10u) != osOK) return;

    uint32_t t_unix = datalog_now_unix();
    while (s_el_tail_i != s_el_head_i) {
        errlog_rec_t r = s_el_ring[s_el_tail_i];
        r.seq = s_el_seq_next;
        if (r.t_unix == 0u) r.t_unix = t_unix;

        /* Zacatek noveho sektoru -> smaz ho (zahodi 128 nejstarsich zaznamu). */
        if ((s_el_write_off % W25Q_SECTOR_SIZE) == 0u) {
            if (!w25q_erase_sector(s_el_write_off)) break;
        }
        uint8_t b[ERRLOG_REC_SIZE];
        el_pack(&r, b);
        if (!w25q_write(s_el_write_off, b, sizeof b)) break;

        s_el_seq_next++;
        s_el_write_off += ERRLOG_REC_SIZE;
        if (s_el_write_off >= W25Q_ERRLOG_BASE + W25Q_ERRLOG_SIZE) s_el_write_off = W25Q_ERRLOG_BASE;
        s_el_tail_i = (s_el_tail_i + 1u) % ERRLOG_RING_N;
    }
    osMutexRelease(qspiMutexHandle);
}

uint32_t errlog_count(void)
{
    uint32_t written = (s_el_seq_next > 1u) ? (s_el_seq_next - 1u) : 0u;
    return (written < (uint32_t)ERRLOG_CAPACITY) ? written : (uint32_t)ERRLOG_CAPACITY;
}

uint32_t errlog_dropped(void) { return s_el_dropped; }

bool errlog_read_back(uint32_t idx_from_newest, errlog_rec_t *out)
{
    if (!out || idx_from_newest >= errlog_count()) return false;
    uint32_t span = W25Q_ERRLOG_SIZE;
    uint32_t back = ((idx_from_newest + 1u) * ERRLOG_REC_SIZE) % span;
    uint32_t rel  = ((s_el_write_off - W25Q_ERRLOG_BASE) + span - back) % span;

    uint8_t b[ERRLOG_REC_SIZE];
    bool ok = false;
    /* ⚠️ KRATKY timeout (50 ms, ne 200): okno CHYBY vola tuhle funkci 8x za sebou
     * z UiTasku, ktery ma watchdog heartbeat s limitem 2,5 s. Pri 200 ms by
     * osm neuspesnych pokusu delalo 1,6 s cekani — zbytecne blizko limitu.
     * Kdyz je flash obsazena, radek se proste nevykresli; to je u prohlizece
     * prijatelne, zablokovany UiTask ne. */
    if (osMutexAcquire(qspiMutexHandle, 50u) == osOK) {
        ok = w25q_read(W25Q_ERRLOG_BASE + rel, b, sizeof b) && el_unpack(b, out);
        osMutexRelease(qspiMutexHandle);
    }
    return ok;
}

uint32_t errlog_read_batch(uint32_t from, uint32_t count, errlog_rec_t *out)
{
    if (!out || count == 0u) return 0u;
    uint32_t total = errlog_count();
    if (from >= total) return 0u;
    if (count > total - from) count = total - from;

    uint32_t got = 0;
    if (osMutexAcquire(qspiMutexHandle, 200u) != osOK) return 0u;
    for (uint32_t k = 0; k < count; k++) {
        uint32_t span = W25Q_ERRLOG_SIZE;
        uint32_t back = (((from + k) + 1u) * ERRLOG_REC_SIZE) % span;
        uint32_t rel  = ((s_el_write_off - W25Q_ERRLOG_BASE) + span - back) % span;
        uint8_t b[ERRLOG_REC_SIZE];
        if (!w25q_read(W25Q_ERRLOG_BASE + rel, b, sizeof b)) break;
        if (!el_unpack(b, &out[got])) break;
        got++;
    }
    osMutexRelease(qspiMutexHandle);
    return got;
}

void errlog_erase(void)
{
    if (osMutexAcquire(qspiMutexHandle, 2000u) != osOK) return;
    for (uint32_t i = 0; i < W25Q_ERRLOG_SECTORS; i++) {
        (void)w25q_erase_sector(W25Q_ERRLOG_BASE + i * W25Q_SECTOR_SIZE);
    }
    s_el_seq_next = 1u;
    s_el_write_off = W25Q_ERRLOG_BASE;
    s_el_ready = 1;
    osMutexRelease(qspiMutexHandle);
}

void errlog_boot_record(void)
{
    /* Duvod resetu + (kdyz byl) crash z BKP. ⚠️ Musi bezet AZ po `MX_RTC_Init`,
     * ktera black-box dekoduje do `g_crash_text` a v BKP ho SMAZE — jinak by se
     * historie ztratila prave u te chyby, kvuli ktere tenhle log vznikl. */
    char tag[ERRLOG_TAG_LEN + 1];
    uint32_t i = 0;
    for (; i < ERRLOG_TAG_LEN && g_reset_text[i]; i++) tag[i] = (char)g_reset_text[i];
    tag[i] = '\0';
    /* Rate-limit se pri startu obchazi zamerne: boot je vzdy zajimavy. */
    s_el_cool_next[ERRLOG_K_BOOT] = HAL_GetTick();
    (void)errlog_put(ERRLOG_K_BOOT, g_display_init_step, RCC->RSR, 0u, tag);

    if (g_crash_text[0]) {
        char ct[ERRLOG_TAG_LEN + 1];
        uint32_t k = 0;
        for (; k < ERRLOG_TAG_LEN && g_crash_text[k]; k++) ct[k] = (char)g_crash_text[k];
        ct[k] = '\0';
        s_el_cool_next[ERRLOG_K_CRASH] = HAL_GetTick();
        (void)errlog_put(ERRLOG_K_CRASH, 0u, g_crash_cfsr, g_crash_bfar, ct);
    }
}
